In [5]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    "Name":['Alice','Bob',np.nan,'Eve'],
    "Age":[25,np.nan,30,23],
    "Score":[np.nan,80,70,50]
})
df

    Name   Age  Score
0  Alice  25.0    NaN
1    Bob   NaN   80.0
2    NaN  30.0   70.0
3    Eve  23.0   50.0

In [6]:
file = df.to_csv("Score.csv",index=False)
file

In [7]:
data = pd.read_csv("Score.csv")
data

    Name   Age  Score
0  Alice  25.0    NaN
1    Bob   NaN   80.0
2    NaN  30.0   70.0
3    Eve  23.0   50.0

In [11]:
data.dropna()

  Name   Age  Score
3  Eve  23.0   50.0

In [21]:
median_age = data['Age'].median()
data.fillna(median_age,inplace=True)
data

    Name   Age  Score
0  Alice  25.0   25.0
1    Bob  25.0   80.0
2   25.0  30.0   70.0
3    Eve  23.0   50.0

In [26]:
mean = data['Score'].mean()
mean

56.25

In [27]:
data.fillna(mean)

    Name   Age  Score
0  Alice  25.0   25.0
1    Bob  25.0   80.0
2   25.0  30.0   70.0
3    Eve  23.0   50.0

In [28]:
data.to_csv("Score_updated.csv",index=False)

In [30]:
import pandas as pd

# Create the DataFrame
data = {
    "Date": ["2024-01-01", "2024-01-02", "2024-01-03", "2024-01-04", None, "2024-01-06"],
    "Product": ["Widget A", "Widget B", None, "Widget D", None, "Widget F"],
    "Region": ["North", "East", "West", None, "South", "West"],
    "Sales": [100, None, 200, 300, 400, None],
    "Profit": [None, 20, 30, 50, 60, 70]
}

df2 = pd.DataFrame(data)
print("Original DataFrame:")
df2

Original DataFrame:

         Date   Product Region  Sales  Profit
0  2024-01-01  Widget A  North  100.0     NaN
1  2024-01-02  Widget B   East    NaN    20.0
2  2024-01-03      None   West  200.0    30.0
3  2024-01-04  Widget D   None  300.0    50.0
4        None      None  South  400.0    60.0
5  2024-01-06  Widget F   West    NaN    70.0

In [40]:
print("dropping the sales row and columns: ")
df2['Sales'].dropna()

dropping the sales row and columns:

0    100.0
2    200.0
3    300.0
4    400.0
Name: Sales, dtype: float64

In [42]:
print("dropping the sales row and columns: ")
df2["Profit"].dropna()

dropping the sales row and columns:

1    20.0
2    30.0
3    50.0
4    60.0
5    70.0
Name: Profit, dtype: float64

In [44]:
df2['Date'].ffill(inplace=True)

In [50]:
df2["Product"].fillna("unknown",inplace=True)

C:\Users\hp\AppData\Local\Temp\ipykernel_1540\4159900764.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2["Product"].fillna("unknown",inplace=True)

In [51]:
df2

         Date   Product Region  Sales  Profit
0  2024-01-01  Widget A  North  100.0     NaN
1  2024-01-02  Widget B   East    NaN    20.0
2  2024-01-03   unknown   West  200.0    30.0
3  2024-01-04  Widget D   None  300.0    50.0
4  2024-01-04   unknown  South  400.0    60.0
5  2024-01-06  Widget F   West    NaN    70.0

In [64]:
df2['Region'].replace('None',"not-specified")
df2

         Date   Product Region  Sales  Profit
0  2024-01-01  Widget A   None  100.0     NaN
1  2024-01-02  Widget B   None    NaN    20.0
2  2024-01-03   unknown   None  200.0    30.0
3  2024-01-04  Widget D   None  300.0    50.0
4  2024-01-04   unknown   None  400.0    60.0
5  2024-01-06  Widget F   None    NaN    70.0